import React from "react";
import styles from "./home.module.css";
import maamourFront from "../../Component/images/maamour-front.webp";

function MainPage() {
  return (
    <div className={styles.container}>
      <img
        src={maamourFront}
        alt="واجهة معمور"
        className={styles.maamourFront}
      ></img>
      <p>
        يُعد مسجد معمور بحي قرطبة في العاصمة السعودية الرياض نموذجا للمسجد
        العصري الصديق للبيئة، والمصمم بأحدث التقنيات الحديثة والخدمات المتكاملة
        التي تجعل المسجد جزءا رئيسيا من حياة المجتمع اليومية.
      </p>
      <p>
        يخدم المسجد كل فئات المجتمع بالحي، ابتداء من الأطفال والنساء والرجال
        وصولا إلى ذوي الاحتياجات الخاصة.
      </p>
      <p>
        ويضم المسجد حضانة أطفال، فباستطاعة الأم التي تأتي لصلاة التراويح أن تترك
        ابنها مع مشرفات متخصصات على الأطفال، بالإضافة إلى الحدائق المجاورة التي
        يمكن أن يلعب فيها الأبناء أمام أنظار آبائهم وأمهاتهم، كما يحوي المسجد
        صالات لتعليم القرآن وصالة متعددة الاستخدام لأهل الحي.
      </p>
      <p>
        على سطح المسجد يوجد ممشى وملعب رياضي لكرة الطائرة، كما توجد فيه صيدلية
        يعود ريعها على أعمال خيرية وتبيع الأدوية بأسعار مخفضة، بالإضافة إلى صراف
        آلي وتموينات غذائية.
      </p>
      <p>
        ويوفر المسجد مواقف وممرات لذوي الاحتياجات الخاصة، كما يوفر "كود الوصول
        الشامل" الذي يتيح مثلا للكفيف دخول المسجد من غير مساعدة.
      </p>
      <p>
        كذلك يرتفع المسجد عشرين سنتيمترا فقط عن الأرض، أي أنه من دون سلالم
        للصعود، وذلك لمساعدة كبار السن وذوي الاحتياجات الخاصة.
      </p>
    </div>
  );
}

export default MainPage;
